{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "layers": [
        {
          "class_name": "Conv2D",
          "config": {
            "filters": 8,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [1, 1],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}},
            "bias_initializer": {"class_name": "Zeros", "config": {}},
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "conv1",
            "trainable": true,
            "batch_input_shape": [null, 28, 28, 1],
            "dtype": "float32"
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "pool_size": [2, 2],
            "padding": "valid",
            "strides": [2, 2],
            "data_format": "channels_last",
            "name": "pool1",
            "trainable": true
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "filters": 16,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [1, 1],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}},
            "bias_initializer": {"class_name": "Zeros", "config": {}},
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "conv2",
            "trainable": true
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "pool_size": [2, 2],
            "padding": "valid",
            "strides": [2, 2],
            "data_format": "channels_last",
            "name": "pool2",
            "trainable": true
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "filters": 32,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [1, 1],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}},
            "bias_initializer": {"class_name": "Zeros", "config": {}},
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "conv3",
            "trainable": true
          }
        },
        {
          "class_name": "Flatten",
          "config": {
            "data_format": "channels_last",
            "name": "flatten",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}},
            "bias_initializer": {"class_name": "Zeros", "config": {}},
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense1",
            "trainable": true
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "rate": 0.25,
            "noise_shape": null,
            "seed": null,
            "name": "dropout",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 10,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}},
            "bias_initializer": {"class_name": "Zeros", "config": {}},
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "output",
            "trainable": true
          }
        }
      ]
    },
    "keras_version": "tfjs-layers 4.0.0",
    "backend": "tensor_flow.js"
  },
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v4.0.0",
  "convertedBy": null,
  "weightsManifest": [
    {
      "paths": ["model.weights.bin"],
      "weights": [
        {"name": "conv1/kernel", "shape": [3, 3, 1, 8], "dtype": "float32"},
        {"name": "conv1/bias", "shape": [8], "dtype": "float32"},
        {"name": "conv2/kernel", "shape": [3, 3, 8, 16], "dtype": "float32"},
        {"name": "conv2/bias", "shape": [16], "dtype": "float32"},
        {"name": "conv3/kernel", "shape": [3, 3, 16, 32], "dtype": "float32"},
        {"name": "conv3/bias", "shape": [32], "dtype": "float32"},
        {"name": "dense1/kernel", "shape": [1568, 64], "dtype": "float32"},
        {"name": "dense1/bias", "shape": [64], "dtype": "float32"},
        {"name": "output/kernel", "shape": [64, 10], "dtype": "float32"},
        {"name": "output/bias", "shape": [10], "dtype": "float32"}
      ]
    }
  ]
}
